dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdlib.h>
#include <math.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_log.h"
#include "esp_err.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "nvs_flash.h"
#include "esp_check.h"

// Hardware / Drivers
#include "bsp/esp32_p4_function_ev_board.h"
#include "bsp_board_extra.h"
#include "driver/sdspi_host.h"

// Modules
#include "config.h"
#include "settings_manager.h" 
#include "wifi_manager.h"
#include "network_manager.h"
#include "mqtt_ha.h"
#include "ha_client.h" 
#include "ota_update.h"
#include "led_status.h"
#include "voice_pipeline.h"
#include "va_control.h"
#include "webserial.h"
#include "local_music_player.h"
#include "audio_capture.h"
#include "alarm_manager.h" 
#include "sys_diag.h" // Phase 9
#include "oled_status.h"

#define TAG "main"

static bool sd_init_done = false;
static TaskHandle_t post_connect_task_handle = NULL;
static char ota_url_value[256] = {0};
static TaskHandle_t music_control_task_handle = NULL;
static bool audio_hw_ready = false;
static TaskHandle_t metrics_task_handle = NULL;
static TaskHandle_t led_ready_task_handle = NULL;

static const char *ota_state_to_string(ota_state_t state);
static const char *music_state_to_string(music_state_t state);
static void mqtt_update_music_state(music_state_t state, int current_track, int total_tracks);
static void mqtt_publish_telemetry(void);
static void mqtt_metrics_task(void *arg);
static bool get_wifi_rssi(int *out_rssi);
static void ota_progress_handler(ota_state_t state, int progress, const char *message);
static void led_ready_task(void *arg);

typedef enum {
    MUSIC_CMD_PLAY = 0,
    MUSIC_CMD_STOP = 1,
} music_cmd_t;

static void music_control_task(void *arg) {
    music_cmd_t cmd = (music_cmd_t)(uintptr_t)arg;

    if (cmd == MUSIC_CMD_PLAY) {
        ESP_LOGI(TAG, "Music play requested (stopping voice pipeline first)");
        voice_pipeline_stop();

        // Wait briefly for WWD to stop and release I2S/codec.
        for (int i = 0; i < 30; i++) {
            if (!voice_pipeline_is_running()) break;
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        vTaskDelay(pdMS_TO_TICKS(150));

        if (local_music_player_is_initialized()) {
            (void)local_music_player_play();
        }
    } else if (cmd == MUSIC_CMD_STOP) {
        ESP_LOGI(TAG, "Music stop requested");
        if (local_music_player_is_initialized()) {
            (void)local_music_player_stop();
        }
        vTaskDelay(pdMS_TO_TICKS(150));
        voice_pipeline_start();
    }

    music_control_task_handle = NULL;
    vTaskDelete(NULL);
}

static const char *ota_state_to_string(ota_state_t state) {
    switch (state) {
        case OTA_STATE_IDLE:
            return "IDLE";
        case OTA_STATE_DOWNLOADING:
            return "DOWNLOADING";
        case OTA_STATE_VERIFYING:
            return "VERIFYING";
        case OTA_STATE_SUCCESS:
            return "SUCCESS";
        case OTA_STATE_FAILED:
            return "FAILED";
        default:
            return "UNKNOWN";
    }
}

static const char *music_state_to_string(music_state_t state) {
    switch (state) {
        case MUSIC_STATE_PLAYING:
            return "PLAYING";
        case MUSIC_STATE_PAUSED:
            return "PAUSED";
        case MUSIC_STATE_STOPPED:
            return "STOPPED";
        case MUSIC_STATE_IDLE:
        default:
            return "IDLE";
    }
}

static bool get_wifi_rssi(int *out_rssi) {
    if (!out_rssi) return false;

    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        return false;
    }
    *out_rssi = ap_info.rssi;
    return true;
}

static void mqtt_update_music_state(music_state_t state, int current_track, int total_tracks) {
    if (!mqtt_ha_is_connected()) {
        return;
    }

    mqtt_ha_update_sensor("music_state", music_state_to_string(state));

    char buf[32];
    snprintf(buf, sizeof(buf), "%d", total_tracks);
    mqtt_ha_update_sensor("total_tracks", buf);

    if (current_track >= 0) {
        char name[64];
        if (local_music_player_get_track_name(name, sizeof(name)) == ESP_OK) {
            mqtt_ha_update_sensor("current_track", name);
        } else {
            snprintf(buf, sizeof(buf), "%d", current_track + 1);
            mqtt_ha_update_sensor("current_track", buf);
        }
    } else {
        mqtt_ha_update_sensor("current_track", "None");
    }
}

static void mqtt_publish_telemetry(void) {
    if (!mqtt_ha_is_connected()) {
        return;
    }

    char buf[64];

    snprintf(buf, sizeof(buf), "%u", (unsigned int)esp_get_free_heap_size());
    mqtt_ha_update_sensor("free_memory", buf);

    snprintf(buf, sizeof(buf), "%llu", (unsigned long long)(esp_timer_get_time() / 1000000ULL));
    mqtt_ha_update_sensor("uptime", buf);

    network_type_t active = network_manager_get_active_type();
    mqtt_ha_update_sensor("network_type", network_manager_type_to_string(active));

    int rssi = 0;
    if (get_wifi_rssi(&rssi)) {
        snprintf(buf, sizeof(buf), "%d", rssi);
        mqtt_ha_update_sensor("wifi_rssi", buf);
        mqtt_ha_update_sensor("wifi_signal", buf);
    } else {
        snprintf(buf, sizeof(buf), "%d", -127);
        mqtt_ha_update_sensor("wifi_rssi", buf);
        mqtt_ha_update_sensor("wifi_signal", buf);
    }

    float agc_gain = audio_capture_get_agc_gain();
    snprintf(buf, sizeof(buf), "%.2f", (double)agc_gain);
    mqtt_ha_update_sensor("agc_current_gain", buf);

    snprintf(buf, sizeof(buf), "%d", webserial_get_client_count());
    mqtt_ha_update_sensor("webserial_requests", buf);

    mqtt_update_music_state(local_music_player_get_state(),
                            local_music_player_get_current_track(),
                            local_music_player_get_total_tracks());

    mqtt_ha_update_sensor("ota_status", ota_state_to_string(ota_update_get_state()));
    snprintf(buf, sizeof(buf), "%d", ota_update_get_progress());
    mqtt_ha_update_sensor("ota_progress", buf);

    mqtt_ha_update_sensor("sd_card_status", bsp_sdcard ? "MOUNTED" : "NOT_MOUNTED");

