dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
    const char *fw = ota_update_get_current_version();
    if (!fw || fw[0] == '\0') {
        fw = FIRMWARE_VERSION;
    }
    mqtt_ha_update_sensor("firmware_version", fw);

    mqtt_ha_update_sensor("ota_update_url",
                          (ota_url_value[0] != '\0') ? ota_url_value : "NOT_SET");

    float wwd = va_control_get_wwd_threshold();
    mqtt_ha_update_number("wwd_detection_threshold", wwd);

    mqtt_ha_update_switch("auto_gain_control", va_control_get_agc_enabled());
    mqtt_ha_update_number("agc_target_level", (float)va_control_get_agc_target_level());

    mqtt_ha_update_switch("led_status_indicator", led_status_is_enabled());
    mqtt_ha_update_switch("wwd_enabled", voice_pipeline_is_running());
}

static void mqtt_metrics_task(void *arg) {
    (void)arg;
    while (1) {
        mqtt_publish_telemetry();
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

static void ota_progress_handler(ota_state_t state, int progress, const char *message) {
    (void)message;
    if (!mqtt_ha_is_connected()) {
        return;
    }

    mqtt_ha_update_sensor("ota_status", ota_state_to_string(state));
    char buf[16];
    snprintf(buf, sizeof(buf), "%d", progress);
    mqtt_ha_update_sensor("ota_progress", buf);
}

static void post_connect_task(void *arg) {
    network_type_t type = (network_type_t)(uintptr_t)arg;

    char ip_str[16];
    if (network_manager_get_ip(ip_str) != ESP_OK) {
        strncpy(ip_str, "0.0.0.0", sizeof(ip_str));
        ip_str[sizeof(ip_str) - 1] = '\0';
    }

    ESP_LOGI(TAG, "Network Connected: %s (IP: %s)", network_manager_type_to_string(type), ip_str);

    if (mqtt_ha_is_connected()) {
        mqtt_ha_update_sensor("ip_address", ip_str);
    }
    oled_status_set_last_event("ip-got");

    // Start web dashboard once network is up.
    webserial_init();

    // SD/music init can be slow; keep it out of the network event loop task.
    if (!sys_diag_is_safe_mode() && !sd_init_done) {
        if (bsp_sdcard_mount() == ESP_OK) {
            ESP_LOGI(TAG, "SD Card mounted");
            local_music_player_init();
            local_music_player_register_callback(NULL); // Or proper callback
            sd_init_done = true;
        }
    }

    post_connect_task_handle = NULL;
    vTaskDelete(NULL);
}

// MQTT Callbacks (Keep implementation same)
static void mqtt_wwd_switch_callback(const char *entity_id, const char *payload) {
    if (strcmp(payload, "ON") == 0) {
        voice_pipeline_start();
        mqtt_ha_update_switch("wwd_enabled", true);
    } else {
        voice_pipeline_stop();
        mqtt_ha_update_switch("wwd_enabled", false);
    }
}

static void mqtt_restart_callback(const char *entity_id, const char *payload) {
    ESP_LOGI(TAG, "Restart requested via MQTT");
    voice_pipeline_trigger_restart();
}

static void mqtt_test_tts_callback(const char *entity_id, const char *payload) {
    voice_pipeline_test_tts("Ovo je test govora.");
}

static void mqtt_diagnostic_dump_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    (void)payload;
    sys_diag_report_status();
}

static void mqtt_music_play_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    (void)payload;
    if (music_control_task_handle == NULL) {
        xTaskCreate(music_control_task, "music_ctl", 4096, (void *)(uintptr_t)MUSIC_CMD_PLAY, 5,
                    &music_control_task_handle);
    }
}

static void mqtt_music_stop_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    (void)payload;
    if (music_control_task_handle == NULL) {
        xTaskCreate(music_control_task, "music_ctl", 4096, (void *)(uintptr_t)MUSIC_CMD_STOP, 5,
                    &music_control_task_handle);
    }
}

static void mqtt_led_test_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    (void)payload;
    led_status_test_pattern();
}

static void mqtt_led_brightness_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;

    char *end = NULL;
    float v = strtof(payload, &end);
    if (end == payload) {
        ESP_LOGW(TAG, "Invalid LED brightness payload: %s", payload);
        return;
    }

    if (v < 0.0f) v = 0.0f;
    if (v > 100.0f) v = 100.0f;

    uint8_t b = (uint8_t)lroundf(v);
    led_status_set_brightness(b);
    (void)mqtt_ha_update_number("led_brightness", (float)b);
}

static void mqtt_output_volume_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;

    char *end = NULL;
    float v = strtof(payload, &end);
    if (end == payload) {
        ESP_LOGW(TAG, "Invalid output volume payload: %s", payload);
        return;
    }

    if (v < 0.0f) v = 0.0f;
    if (v > 100.0f) v = 100.0f;
    int vol = (int)lroundf(v);

    // Apply immediately (affects TTS, music, beeps)
    if (!audio_hw_ready) {
        ESP_LOGW(TAG, "Output volume set requested but audio hardware is not ready");
        return;
    }
    bsp_extra_codec_volume_set(vol, NULL);
    (void)mqtt_ha_update_number("output_volume", (float)vol);

    // Persist to NVS
    app_settings_t s;
    if (settings_manager_load(&s) == ESP_OK) {
        s.output_volume = vol;
        (void)settings_manager_save(&s);
    }
}

static void mqtt_wwd_threshold_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;

    char *end = NULL;
    float v = strtof(payload, &end);
    if (end == payload) {
        ESP_LOGW(TAG, "Invalid WWD threshold payload: %s", payload);
        return;
    }

    if (v < 0.5f) v = 0.5f;
    if (v > 0.95f) v = 0.95f;

    va_control_set_wwd_threshold(v);
    mqtt_ha_update_number("wwd_detection_threshold", v);
}

static void mqtt_agc_enabled_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;

    bool enable = (strcmp(payload, "ON") == 0);
    va_control_set_agc_enabled(enable);
    mqtt_ha_update_switch("auto_gain_control", enable);
}

static void mqtt_agc_target_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;

    char *end = NULL;
    float v = strtof(payload, &end);
    if (end == payload) {
        ESP_LOGW(TAG, "Invalid AGC target payload: %s", payload);
        return;
    }

    if (v < 0.0f) v = 0.0f;
    if (v > 10000.0f) v = 10000.0f;

    uint16_t target = (uint16_t)lroundf(v);
    va_control_set_agc_target_level(target);
    mqtt_ha_update_number("agc_target_level", (float)target);
}

static void mqtt_led_indicator_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;

    bool enable = (strcmp(payload, "ON") == 0);
    led_status_enable(enable);
    mqtt_ha_update_switch("led_status_indicator", enable);
}

