dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
static void mqtt_ota_url_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;

    strncpy(ota_url_value, payload, sizeof(ota_url_value) - 1);
    ota_url_value[sizeof(ota_url_value) - 1] = '\0';

    ESP_LOGI(TAG, "OTA URL set via MQTT: %s", ota_url_value);
    (void)mqtt_ha_update_text("ota_url_input", ota_url_value);
    mqtt_ha_update_sensor("ota_update_url",
                          (ota_url_value[0] != '\0') ? ota_url_value : "NOT_SET");
    oled_status_set_ota_url_present(ota_url_value[0] != '\0');

    // Save to settings
    app_settings_t s;
    if (settings_manager_load(&s) == ESP_OK) {
        strncpy(s.ota_url, ota_url_value, sizeof(s.ota_url)-1);
        s.ota_url[sizeof(s.ota_url)-1] = '\0';
        settings_manager_save(&s);
    }
}

static void mqtt_ota_trigger_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    (void)payload;

    if (ota_url_value[0] == '\0') {
        ESP_LOGW(TAG, "OTA trigger pressed but OTA URL is empty");
        return;
    }

    ESP_LOGI(TAG, "Starting OTA from MQTT URL: %s", ota_url_value);
    esp_err_t err = ota_update_start(ota_url_value);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "OTA start failed: %s", esp_err_to_name(err));
    }
}

// VAD / Voice Pipeline Callbacks
static void mqtt_vad_threshold_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;
    char *end = NULL;
    float v = strtof(payload, &end);
    if (end != payload) {
        uint32_t val = (uint32_t)v;
        va_control_set_vad_threshold(val);
        mqtt_ha_update_number("vad_threshold", (float)val);
    }
}

static void mqtt_vad_silence_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;
    char *end = NULL;
    float v = strtof(payload, &end);
    if (end != payload) {
        uint32_t val = (uint32_t)v;
        va_control_set_vad_silence_duration_ms(val);
        mqtt_ha_update_number("vad_silence_ms", (float)val);
    }
}

static void mqtt_vad_min_speech_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;
    char *end = NULL;
    float v = strtof(payload, &end);
    if (end != payload) {
        uint32_t val = (uint32_t)v;
        va_control_set_vad_min_speech_ms(val);
        mqtt_ha_update_number("vad_min_speech_ms", (float)val);
    }
}

static void mqtt_vad_max_recording_callback(const char *entity_id, const char *payload) {
    (void)entity_id;
    if (!payload) return;
    char *end = NULL;
    float v = strtof(payload, &end);
    if (end != payload) {
        uint32_t val = (uint32_t)v;
        va_control_set_vad_max_recording_ms(val);
        mqtt_ha_update_number("vad_max_recording_ms", (float)val);
    }
}

static void mqtt_setup_task(void *arg) {
    ESP_LOGI(TAG, "Waiting for MQTT connection...");
    while (!mqtt_ha_is_connected()) {
        vTaskDelay(pdMS_TO_TICKS(500));
    }

    ESP_LOGI(TAG, "Registering HA Entities...");
    
    mqtt_ha_register_switch("wwd_enabled", "Wake Word Detection", mqtt_wwd_switch_callback);
    mqtt_ha_register_switch("auto_gain_control", "Auto Gain Control", mqtt_agc_enabled_callback);
    mqtt_ha_register_switch("led_status_indicator", "LED Status Indicator", mqtt_led_indicator_callback);
    mqtt_ha_register_button("restart", "Restart Device", mqtt_restart_callback);
    mqtt_ha_register_button("test_tts", "Test TTS", mqtt_test_tts_callback);
    mqtt_ha_register_button("diagnostic_dump", "Diagnostic Dump", mqtt_diagnostic_dump_callback);

    mqtt_ha_register_sensor("va_status", "VA Status", NULL, NULL);
    mqtt_ha_register_sensor("va_response", "VA Response", NULL, NULL);
    mqtt_ha_register_sensor("wifi_rssi", "WiFi Signal", "dBm", "signal_strength");
    mqtt_ha_register_sensor("wifi_signal", "WiFi Signal", "dBm", "signal_strength");
    mqtt_ha_register_sensor("ip_address", "IP Address", NULL, NULL);
    mqtt_ha_register_sensor("free_memory", "Free Memory", "bytes", "data_size");
    mqtt_ha_register_sensor("uptime", "Uptime", "s", NULL);
    mqtt_ha_register_sensor("firmware_version", "Firmware Version", NULL, NULL);
    mqtt_ha_register_sensor("network_type", "Network Type", NULL, NULL);
    mqtt_ha_register_sensor("webserial_requests", "WebSerial Requests", NULL, NULL);
    mqtt_ha_register_sensor("agc_current_gain", "AGC Current Gain", NULL, NULL);
    mqtt_ha_register_sensor("music_state", "Music State", NULL, NULL);
    mqtt_ha_register_sensor("current_track", "Current Track", NULL, NULL);
    mqtt_ha_register_sensor("total_tracks", "Total Tracks", NULL, NULL);
    mqtt_ha_register_sensor("sd_card_status", "SD Card Status", NULL, NULL);
    mqtt_ha_register_sensor("ota_status", "OTA Status", NULL, NULL);
    mqtt_ha_register_sensor("ota_progress", "OTA Progress", "%", NULL);
    mqtt_ha_register_sensor("ota_update_url", "OTA Update URL", NULL, NULL);

    mqtt_ha_register_number("led_brightness", "LED Brightness", 0, 100, 1, "%",
                            mqtt_led_brightness_callback);
    mqtt_ha_register_number("output_volume", "Output Volume", 0, 100, 1, "%",
                            mqtt_output_volume_callback);
    mqtt_ha_register_number("agc_target_level", "AGC Target Level", 0, 10000, 50, "",
                            mqtt_agc_target_callback);
    mqtt_ha_register_number("wwd_detection_threshold", "WWD Detection Threshold", 0.5f, 0.95f, 0.01f, "",
                            mqtt_wwd_threshold_callback);

    mqtt_ha_register_text("ota_url_input", "OTA URL", mqtt_ota_url_callback);
    mqtt_ha_register_button("ota_trigger", "Start OTA", mqtt_ota_trigger_callback);

    mqtt_ha_register_button("music_play", "Play Music", mqtt_music_play_callback);
    mqtt_ha_register_button("music_stop", "Stop Music", mqtt_music_stop_callback);
    mqtt_ha_register_button("led_test", "LED Test", mqtt_led_test_callback);

    // VAD Configuration Entities
    mqtt_ha_register_number("vad_threshold", "VAD Threshold", 0, 1000, 10, "", mqtt_vad_threshold_callback);
    mqtt_ha_register_number("vad_silence_ms", "VAD Silence (ms)", 100, 5000, 100, "ms", mqtt_vad_silence_callback);
    mqtt_ha_register_number("vad_min_speech_ms", "VAD Min Speech (ms)", 100, 2000, 50, "ms", mqtt_vad_min_speech_callback);
    mqtt_ha_register_number("vad_max_recording_ms", "VAD Max Rec (ms)", 1000, 15000, 500, "ms", mqtt_vad_max_recording_callback);
    
