dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
    // Initial State
    mqtt_ha_update_switch("wwd_enabled", true);
    mqtt_ha_update_switch("auto_gain_control", va_control_get_agc_enabled());
    mqtt_ha_update_switch("led_status_indicator", led_status_is_enabled());

    // Publish current IP once MQTT is up (covers cases where network connected earlier).
    char ip_str[16];
    if (network_manager_get_ip(ip_str) == ESP_OK) {
        mqtt_ha_update_sensor("ip_address", ip_str);
    }

    // Publish initial LED brightness and OTA URL state.
    mqtt_ha_update_number("led_brightness", (float)led_status_get_brightness());
    mqtt_ha_update_number("output_volume", (float)bsp_extra_codec_volume_get());
    mqtt_ha_update_number("agc_target_level", (float)va_control_get_agc_target_level());
    mqtt_ha_update_number("wwd_detection_threshold", va_control_get_wwd_threshold());

    // Publish initial VAD settings
    mqtt_ha_update_number("vad_threshold", (float)va_control_get_vad_threshold());
    mqtt_ha_update_number("vad_silence_ms", (float)va_control_get_vad_silence_duration_ms());
    mqtt_ha_update_number("vad_min_speech_ms", (float)va_control_get_vad_min_speech_ms());
    mqtt_ha_update_number("vad_max_recording_ms", (float)va_control_get_vad_max_recording_ms());

    if (ota_url_value[0] != '\0') {
        mqtt_ha_update_text("ota_url_input", ota_url_value);
        mqtt_ha_update_sensor("ota_update_url", ota_url_value);
        oled_status_set_ota_url_present(true);
    } else {
        mqtt_ha_update_sensor("ota_update_url", "NOT_SET");
        oled_status_set_ota_url_present(false);
    }

    mqtt_publish_telemetry();
    if (metrics_task_handle == NULL) {
        xTaskCreate(mqtt_metrics_task, "mqtt_metrics", 4096, NULL, 4, &metrics_task_handle);
    }
    
    // Report System Status (Crash info)
    sys_diag_report_status();

    vTaskDelete(NULL);
}

static void network_event_callback(network_type_t type, bool connected) {
    if (connected) {
        if (post_connect_task_handle == NULL) {
            xTaskCreate(post_connect_task, "net_post", 4096, (void *)(uintptr_t)type, 5,
                        &post_connect_task_handle);
        }
        if (type == NETWORK_TYPE_ETHERNET) {
            oled_status_set_last_event("eth-up");
        } else if (type == NETWORK_TYPE_WIFI) {
            oled_status_set_last_event("wifi-up");
        }
    } else {
        if (type == NETWORK_TYPE_ETHERNET) {
            oled_status_set_last_event("eth-down");
        } else if (type == NETWORK_TYPE_WIFI) {
            oled_status_set_last_event("wifi-down");
        }
    }
}

static void music_state_callback(music_state_t state, int current_track, int total_tracks) {
    bool is_playing = (state == MUSIC_STATE_PLAYING || state == MUSIC_STATE_PAUSED);
    voice_pipeline_on_music_state_change(is_playing);
    mqtt_update_music_state(state, current_track, total_tracks);

    oled_music_state_t oled_state = OLED_MUSIC_OFF;
    if (state == MUSIC_STATE_PLAYING) {
        oled_state = OLED_MUSIC_PLAYING;
    } else if (state == MUSIC_STATE_PAUSED) {
        oled_state = OLED_MUSIC_PAUSED;
    }
    oled_status_set_music_state(oled_state, current_track, total_tracks);
}

static void led_ready_task(void *arg) {
    (void)arg;
    bool last_ha_ok = ha_client_is_connected();
    int64_t last_change = esp_timer_get_time();

    while (1) {
        bool ha_ok = ha_client_is_connected();
        int64_t now = esp_timer_get_time();

        if (ha_ok != last_ha_ok) {
            last_change = now;
            last_ha_ok = ha_ok;
        }

        if (voice_pipeline_is_running()) {
            led_status_t current = led_status_get();
            int64_t elapsed = now - last_change;

            if (!ha_ok && current == LED_STATUS_IDLE && elapsed >= 3000LL * 1000LL) {
                led_status_set(LED_STATUS_CONNECTING);
            } else if (ha_ok && current == LED_STATUS_CONNECTING &&
                       elapsed >= 1000LL * 1000LL) {
                led_status_set(LED_STATUS_IDLE);
            }
        }

        vTaskDelay(pdMS_TO_TICKS(200));
    }
}

void app_main(void) {
    // 1. NVS Init
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    // 2. System Diagnostics (Boot Loop Protection)
    bool safe_mode = (sys_diag_init() != ESP_OK);
    
    if (safe_mode) {
        ESP_LOGE(TAG, "STARTING IN SAFE MODE (Audio disabled)");
        // Init minimal LED
        led_status_init();
        led_status_set(LED_STATUS_ERROR); // Red Blink
    } else {
        ESP_LOGI(TAG, "Starting ESP32-P4 Voice Assistant (Normal Mode)");
        // 3. Hardware Init (Codec, LED)
        ESP_LOGI(TAG, "Initializing Hardware...");
        ESP_ERROR_CHECK(bsp_extra_codec_init());
        bsp_extra_codec_volume_set(60, NULL);
        bsp_extra_player_init();
        audio_hw_ready = true;
        
        led_status_init();
        led_status_set(LED_STATUS_BOOTING);
    }

    oled_status_init();
    oled_status_set_safe_mode(safe_mode);
    oled_status_set_last_event(safe_mode ? "safe-on" : "boot");

    // OTA module (available in both normal and safe mode)
    ota_update_init();
    ota_update_register_callback(ota_progress_handler);

    // 4. Watchdog Init (30 seconds timeout)
    sys_diag_wdt_init(30);

    // 5. Load Settings
    app_settings_t settings;
    if (settings_manager_load(&settings) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to load settings!");
    }

    // Apply persisted output volume (default 60)
    if (!safe_mode) {
        bsp_extra_codec_volume_set(settings.output_volume, NULL);
    }

    // Load persisted OTA URL
    if (settings.ota_url[0] != '\0') {
        strncpy(ota_url_value, settings.ota_url, sizeof(ota_url_value)-1);
        ota_url_value[sizeof(ota_url_value)-1] = '\0';
        ESP_LOGI(TAG, "Loaded OTA URL from settings: %s", ota_url_value);
    }
    oled_status_set_ota_url_present(ota_url_value[0] != '\0');

    // 6. Network Init
    network_manager_register_callback(network_event_callback);
    network_manager_init();

    mqtt_ha_config_t mqtt_conf = {
        .broker_uri = settings.mqtt_broker_uri,
        .username = settings.mqtt_username,
        .password = settings.mqtt_password,
        .client_id = settings.mqtt_client_id
    };
    mqtt_ha_init(&mqtt_conf);
    mqtt_ha_start();

    // 7. Core Systems (Skip in Safe Mode)
    if (!safe_mode) {
        ha_client_config_t ha_conf = {
            .hostname = settings.ha_hostname,
            .port = settings.ha_port,
            .access_token = settings.ha_token,
            .use_ssl = settings.ha_use_ssl
        };
        ha_client_init(&ha_conf);

        ESP_LOGI(TAG, "Initializing Voice Pipeline...");
        ESP_ERROR_CHECK(voice_pipeline_init());
        
        alarm_manager_init();
        local_music_player_register_callback(music_state_callback);

        ESP_LOGI(TAG, "System Ready. Waiting for Wake Word...");
        led_status_set(LED_STATUS_IDLE);
        voice_pipeline_start();
        if (led_ready_task_handle == NULL) {
            xTaskCreate(led_ready_task, "led_ready", 2048, NULL, 2, &led_ready_task_handle);
        }
    } else {
        // Safe Mode Loop
        ESP_LOGW(TAG, "Safe Mode: Use Web/OTA to fix issues.");
    }

    xTaskCreate(mqtt_setup_task, "mqtt_setup", 4096, NULL, 5, NULL);

    // Main Loop - Keep main task alive to feed watchdog
    while (1) {
        sys_diag_wdt_feed();
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}
